In [1]:
import pandas as pd

In [6]:
analistas = pd.DataFrame([{'ID': 1,'Nombre': 'Alberto'},
                          {'ID': 2,'Nombre': 'Winser'},
                          {'ID': 3,'Nombre': 'Radi'}])
analistas

   ID   Nombre
0   1  Alberto
1   2   Winser
2   3     Radi

In [8]:
proyectos = pd.DataFrame([{'IDpro': 1,'Proyecto': 'Reporte Ventas', 'IdAnalista': 2}, 
                          {'IDpro': 2,'Proyecto': 'Reporte Nomina', 'IdAnalista': 3}, 
                          {'IDpro': 3,'Proyecto': 'Reporte Gastos', 'IdAnalista': 1}, 
                          {'IDpro': 4,'Proyecto': 'Reporte Costos', 'IdAnalista': 1}])
proyectos

   IDpro        Proyecto  IdAnalista
0      1  Reporte Ventas           2
1      2  Reporte Nomina           3
2      3  Reporte Gastos           1
3      4  Reporte Costos           1

In [11]:
tabla = pd.merge(analistas,proyectos,left_on='ID',right_on='IdAnalista')

tabla

   ID   Nombre  IDpro        Proyecto  IdAnalista
0   1  Alberto      3  Reporte Gastos           1
1   1  Alberto      4  Reporte Costos           1
2   2   Winser      1  Reporte Ventas           2
3   3     Radi      2  Reporte Nomina           3

In [12]:
tabla.drop(['ID','IdAnalista'],axis=1)

    Nombre  IDpro        Proyecto
0  Alberto      3  Reporte Gastos
1  Alberto      4  Reporte Costos
2   Winser      1  Reporte Ventas
3     Radi      2  Reporte Nomina